MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/system/src/nuvoton/nano103/thirdparty/nano103/rtc.c
/**************************************************************************//**
 * @file     rtc.c
 * @version  V1.00
 * $Revision: 4 $
 * $Date: 15/12/29 2:45p $
 * @brief    Nano 103 RTC driver source file
 *
 * @note
 * SPDX-License-Identifier: Apache-2.0
 * Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/


#include <stdio.h>
#include "Nano103.h"

/*---------------------------------------------------------------------------------------------------------*/
/* Includes of local headers                                                                               */
/*---------------------------------------------------------------------------------------------------------*/



/** @addtogroup NANO103_Device_Driver NANO103 Device Driver
  @{
*/

/** @addtogroup NANO103_RTC_Driver RTC Driver
  @{
*/
/// @cond HIDDEN_SYMBOLS

/*---------------------------------------------------------------------------------------------------------*/
/* Macro, type and constant definitions                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
#define RTC_GLOBALS

/*---------------------------------------------------------------------------------------------------------*/
/* Global file scope (static) variables                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
static volatile uint32_t g_u32Reg, g_u32Reg1,g_u32hiYear,g_u32loYear,g_u32hiMonth,g_u32loMonth,g_u32hiDay,g_u32loDay;
static volatile uint32_t g_u32hiHour,g_u32loHour,g_u32hiMin,g_u32loMin,g_u32hiSec,g_u32loSec;

void RTC_RWEN(void)
{
    uint32_t u32TimeOutCount = SystemCoreClock; // 1 second timeout
    uint32_t i = 0;

    RTC->RWEN = RTC_WRITE_KEY;

    //while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk)) RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk))
    {
		RTC->RWEN = RTC_WRITE_KEY;
        i++;
        if(i > u32TimeOutCount) break;
    }

    u32TimeOutCount = SystemCoreClock;
    i = 0;
    while(RTC->RWEN & RTC_RWEN_RTCBUSY_Msk)
    {
        i++;
        if(i > u32TimeOutCount) break;
    }
}

/// @endcond HIDDEN_SYMBOLS

/** @addtogroup NANO103_RTC_EXPORTED_FUNCTIONS RTC Exported Functions
  @{
*/


/**
 *  @brief    Set Frequency Compensation Data
 *
 *  @param[in]    i32FrequencyX10000    Specify the RTC clock X10000, ex: 327736512 means 32773.6512.
 *
 *  @return   None
 *
 */
void RTC_32KCalibration(int32_t i32FrequencyX10000)
{
    uint64_t u64Compensate;

    //u64Compensate = (uint64_t)(0x64000000000);
    u64Compensate = (uint64_t)(0x2710000000000);
    u64Compensate = (uint64_t)(u64Compensate / (uint64_t)i32FrequencyX10000);

    if(u64Compensate >= 0x400000)
    {
        u64Compensate = 0x3FFFFF;
    }

    RTC_RWEN();
    RTC->FREQADJ = (uint32_t)u64Compensate;

}

/**
 *  @brief    This function is used to: \n
 *            1. Write initial key to let RTC start count.  \n
 *            2. Input parameter indicates start time.      \n
 *            Null pointer for using default starting time. \n
 *
 *  @param[in]    sPt \n
 *                     Specify the time property and current time. It includes:                          \n
 *                     u32Year: Year value.                                                               \n
 *                     u32Month: Month value.                                                             \n
 *                     u32Day: Day value.                                                                 \n
 *                     u32DayOfWeek: Day of week. [ \ref RTC_SUNDAY / \ref RTC_MONDAY / \ref RTC_TUESDAY /
 *                                                  \ref RTC_WEDNESDAY / \ref RTC_THURSDAY / \ref RTC_FRIDAY /
 *                                                  \ref RTC_SATURDAY]                                       \n
 *                     u32Hour: Hour value.                                                               \n
 *                     u32Minute: Minute value.                                                           \n
 *                     u32Second: Second value.                                                           \n
 *                     u32TimeScale: [ \ref RTC_CLOCK_12 / \ref RTC_CLOCK_24]                                  \n
 *                     u8AmPm: [ \ref RTC_AM / \ref RTC_PM]                                                    \n
 *
 *  @retval 0: SUCCESS
 *  @retval -1: Initialize RTC module fail
 */
int32_t RTC_Open(S_RTC_TIME_DATA_T *sPt)
{
    uint32_t u32TimeOutCount = SystemCoreClock; // 1 second timeout
    uint32_t u32Reg;

    RTC->INIT = RTC_INIT_KEY;

    if(RTC->INIT != 0x1)
    {
        while(RTC->INIT != 0x1)
        {
            if(u32TimeOutCount == 0) return -1;
            u32TimeOutCount--;
        }
    }

    if(sPt == NULL)
        return -1;

    /*-----------------------------------------------------------------------------------------------------*/
    /* Second, set RTC 24/12 hour setting                                                                  */
    /*-----------------------------------------------------------------------------------------------------*/
    if (sPt->u32TimeScale == RTC_CLOCK_12)
    {
        RTC_RWEN();
        RTC->CLKFMT &= ~RTC_CLKFMT_24HEN_Msk;

        /*-------------------------------------------------------------------------------------------------*/
        /* important, range of 12-hour PM mode is 21 up to 32                                              */
        /*-------------------------------------------------------------------------------------------------*/
        if (sPt->u32AmPm == RTC_PM)
            sPt->u32Hour += 20;
    }
    else
    {
        RTC_RWEN();
        RTC->CLKFMT |= RTC_CLKFMT_24HEN_Msk;
    }

